s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
/*
 * menu: how a child picks an app.
 *
 * Landscape, full-screen. Icons only, packed from the TOP of the screen down
 * - no borders, no tile rectangles, no app name printed underneath. The
 * owner's words for this design: "je pense qu'on fait juste des icones... ne
 * mets que les icones, en haut de l'ecran, sans texte, sans bordure."
 * Pictures only: reading English is not the entry fee for a child who cannot
 * yet, and now neither is reading a frame around a picture.
 *
 * A ROW became a GRID on 2026-08-15, and the owner's sentence above survived
 * it intact: still only icons, still no text and no border, still starting at
 * the top of the glass. What changed is that they now wrap onto a second and
 * third row when there are more than four, because a row alone runs out of
 * finger-widths at six apps - see "THE LAYOUT" below for the arithmetic and
 * docs/decisions/0013 for the argument.
 *
 * Touch is the ONLY input this file reads. Touching an icon launches that
 * app immediately - "je veux que ce soit que du touch. toucher une app ouvre
 * une app." There used to also be a button-driven cursor (BOOT moved a
 * selection, PWR-short launched it) for a device held sideways with both
 * thumbs on the buttons and no finger free for the glass. That path, and the
 * "which tile is selected" state it needed, are both gone: with touch as the
 * only way to launch, there is nothing left to select in advance and nothing
 * left to draw a cursor around. One less piece of state to get wrong is a
 * simplification, not a loss - see menu_state_t's comment.
 *
 * The touch TARGET is not the small icon itself: each icon owns a CELL of a
 * grid that fills the glass, and the grid is invisible - nothing is drawn
 * for it, no border, no separator, no page dot. It exists only in
 * menu_hit(). See "THE LAYOUT" below for the sizes and the arithmetic, and
 * docs/decisions/0013 for why this is a grid rather than pages, a wheel, or
 * a short list of favourites.
 *
 * Opening and closing the menu (the BOOT+PWR long-press chord) is entirely
 * the runtime's business; this file never reads the PMIC and never calls
 * app_switch_to() with its own index. It only ever switches TO a real
 * g_apps[] entry, on a touch.
 */
#include <math.h>
#include <stdio.h>

#include <stdbool.h>

#include "app.h"
#include "gfx.h"
#include "sensors.h"
#include "menu.h"
#include "shapes.h"

// Named directly, the same trick runtime.c uses to single out the
// sketchpad: picking an icon for a tile has to know which app it is looking
// at, and app_t carries nothing more specific than a display name (which is
// free-form text the app itself chose, not a stable identifier this file
// should be parsing).
extern const app_t g_chronoApp;
extern const app_t g_sketchApp;
extern const app_t g_timerApp;
extern const app_t g_fourApp;

/* =====================================================================
 * THE LAYOUT. Landscape coordinates, LAND_W x LAND_H = 448 x 368.
 *
 * WHAT THIS REPLACED, AND THE ONE NUMBER THAT SETTLED IT. Until
 * 2026-08-15 this was a single ROW of full-height columns, one per app,
 * LAND_W/g_appCount wide and the panel's whole 368px tall. That design
 * spends the entire vertical axis on a target that needs 75px of it, so
 * its capacity is decided by the horizontal axis alone, and every app
 * added narrows every other app's target:
 *
 *     apps   column   against a child's ~75px fingertip (AGENTS.md)
 *        3    149px   two fingers, roomy
 *        4    112px   one and a half, where it shipped
 *        6     74px   UNDER ONE FINGER - this is where it breaks
 *       12     37px   half a finger
 *
 * The owner's list (tic-tac-toe, breakout, a spirit level, a clock, the
 * dinosaur, bowling, tilt-a-ball) lands at twelve, and two of those were
 * being written the evening this was rewritten. The SIXTH app crosses the
 * line, not some future one - docs/decisions/0010, "The menu breaks at
 * six, not twelve".
 *
 * THE FIX IS ARITHMETIC, NOT A GESTURE. The panel is about 5.9 fingertips
 * across and 4.9 down, so it physically holds roughly twenty finger-sized
 * targets. A row of columns can only ever offer five. Using the second
 * axis is a fourfold increase in capacity that costs nothing and needs no
 * new input: twelve apps fit on one screen at 112 x 112 each, which is one
 * and a half fingertips in BOTH directions. So there is no paging, no
 * scrolling, no swipe, no wheel and no momentum on this screen, and there
 * is nothing hidden from a child who cannot read a page number.
 *
 * THE CELL IS FIXED AT 112 TALL AND NEVER SHRINKS. This is the property
 * worth protecting, more than any single measurement: the cell height is a
 * constant, and the cell width bottoms out at LAND_W/MENU_COLS_MAX = 112
 * once there are four apps. So from the fourth app to the twelfth, ADDING
 * AN APP NEVER SHRINKS AN EXISTING TARGET. What the twelfth app spends is
 * cancel-band height (see THE CANCEL BAND below), not anybody's target.
 * The old design spent every target on every app.
 *
 * The resulting sizes, which are what the design is judged on:
 *
 *     apps   grid   cell (w x h)   fingertips     cancel band
 *        4    4x1     112 x 112     1.5 x 1.5           256px
 *        6    3x2     149 x 112     2.0 x 1.5           144px
 *        9    3x3     149 x 112     2.0 x 1.5            32px
 *       12    4x3     112 x 112     1.5 x 1.5            32px
 *
 * WHERE IT STOPS, said out loud rather than discovered. Three rows of 112
 * is 336 of the panel's 368, so twelve is the ceiling at MENU_COLS_MAX=4
 * and a 96px icon. A thirteenth app does not fall off the screen (rows are
 * clamped and the rows simply carry more, narrower cells) but its targets
 * go under a fingertip, and THAT is the point at which this design owes a
 * second one - a smaller icon buys sixteen, and past that something has to
 * be hidden. Twelve is the owner's whole list.
 *
 * NOTHING HERE IS DRAWN. Decision 0009 forbids hard edges, right angles
 * and dead straight lines, and a grid of icons is exactly where those
 * creep back in. They do not, because the grid is not a picture: no cell
 * border, no separator, no tile rectangle, no page dot, no label. The only
 * marks on the glass are the icons themselves and a round halo. The grid
 * lives entirely in menu_hit() and cell_rect_land().
 *
 * g_appCount is an extern int, not a macro (sized from the linked app
 * table, see app.h), so every split below is computed at runtime rather
 * than checked with a compile-time _Static_assert.
 * ===================================================================== */

#define ICON_W 96
#define ICON_H 96

