s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
// THE CELL. 112px is one and a half child fingertips, it holds the 96px
// icon box with 8px of air all round, and it is a multiple of 8 - which is
// not a coincidence but decision 0001: gfx maps a landscape rectangle to
// the panel with width and height swapped, so a cell's landscape HEIGHT is
// the pushed row length, and the row length is what has to be a multiple of
// 8. A cell height of 110 or 120 would be just as finger-sized and would
// break every push this file makes.
#define MENU_CELL_H   112

// Four across is the widest row this panel can carry at a full fingertip
// and a half: LAND_W / 4 = 112 exactly, with no remainder to hand anybody.
#define MENU_COLS_MAX 4

// Three rows of 112 = 336, leaving MENU_BAND_MIN below. Derived, not
// chosen, so that changing MENU_CELL_H cannot silently overrun the panel.
#define MENU_ROWS_MAX (LAND_H / MENU_CELL_H) // 3

// How many rows the current app count needs. Clamped at MENU_ROWS_MAX so a
// thirteenth app widens the rows instead of drawing a row off the bottom of
// the glass - see WHERE IT STOPS above.
static int menu_rows(void) {
    int n = g_appCount;
    if (n < 1) return 1;
    int rows = (n + MENU_COLS_MAX - 1) / MENU_COLS_MAX;
    if (rows > MENU_ROWS_MAX) rows = MENU_ROWS_MAX;
    if (rows < 1) rows = 1;
    return rows;
}

// Row r's first app index and how many apps are in it. BALANCED, earlier
// rows taking the extra: n apps over `rows` rows gives every row n/rows,
// and the first n%rows rows one more. No row is ever two apps longer than
// another, which matters because the LONGEST row is the one that decides
// the narrowest cell on the screen. Five apps are 3 then 2 (149px then
// 224px cells), never 4 then 1.
static void menu_row_span(int r, int *first, int *cols) {
    int n = g_appCount;
    int rows = menu_rows();
    int base = n / rows;
    int extra = n % rows;
    *first = r * base + (r < extra ? r : extra);
    *cols  = base + (r < extra ? 1 : 0);
}

// Cell i's landscape rectangle. Contiguous and full-width within its row
// (no gap, no margin either side): the LAST cell of a row absorbs whatever
// LAND_W does not divide evenly, so every x in [0, LAND_W) belongs to
// exactly one cell and none of it is dead space a touch can fall into and
// hit nothing. That was the old column layout's best property and it is
// kept exactly, now in two dimensions.
static void cell_rect_land(int i, int *bx, int *by, int *bw, int *bh) {
    int rows = menu_rows();
    int r = 0, first = 0, cols = 1;
    for (r = 0; r < rows; r++) {
        menu_row_span(r, &first, &cols);
        if (i < first + cols) break;
    }
    if (r >= rows) { r = rows - 1; menu_row_span(r, &first, &cols); } // unreachable
                                                                       // for a valid
                                                                       // index; clamps
                                                                       // rather than
                                                                       // reads past
    int c = i - first;
    int w = LAND_W / cols;
    *bx = c * w;
    *bw = (c == cols - 1) ? (LAND_W - *bx) : w;
    *by = r * MENU_CELL_H;
    *bh = MENU_CELL_H;
}

// The touch coordinates a tick() sees arrive in PANEL (portrait) space, not
// landscape - see app.h's comment on touchX/touchY and gfx.h's note that it
// rotates rectangles, not pixels, so a landscape app that hit-tests a touch
// has to invert the mapping itself. gfx.h only documents the forward
// direction (landscape -> panel: px = PANEL_W-1-ly, py = lx, see gfx_land_
// rect's header comment) because chrono and timer, the other two landscape
// apps, never need the inverse: they draw digits, not touch targets. Solved
// here by algebra on that same documented mapping, not by a new gfx.h
// helper (nothing else needs it, same reasoning as this file's icon code
// below).
static void panel_to_land(int px, int py, int *lx, int *ly) {
    *lx = py;
    *ly = PANEL_W - 1 - px;
}

// THE TOUCH TARGET, and THE CANCEL BAND, in one function.
//
// Not the icon's own 96px box: the whole cell, never smaller than
// 112 x 112 at any app count up to twelve (see THE LAYOUT above for the
// table). AGENTS.md measures a child's fingertip contact at ~75px on this
// panel, so every target here is one and a half fingertips across and one
// and a half down, and a child aiming only roughly at a picture still gets
// it.
//
// Size is not the only forgiveness and it is not even the main one. The
// gesture is press-drag-release (see THE GESTURE below), so the cell under
// the thumb is LIT before anything launches: a child who lands on the wrong
// picture sees the wrong picture light up and slides, without lifting. A
// 112px cell you can correct beats a 149px cell that fires on contact.
//
// THE CANCEL BAND is everything below the grid, and it is a leftover rather
// than a reserved strip: the grid packs to the TOP of the glass (the
// owner's own instruction for the icons, "en haut de l'ecran"), and
// whatever the rows do not use is where a release does nothing. That is
// 256px at four apps, 144px at six, and 32px at nine or twelve - the
// twelfth app is paid for out of THIS, which is the only thing left that
// can shrink. At 32px it is still a real region for the gesture it exists
// for, because what the controller reports is a contact CENTROID, not the
// contact patch: a thumb slid to the bottom edge of the glass has its
// centroid pinned there. But say the cost plainly - at twelve apps,
// cancelling means a deliberate slide all the way to the bottom edge,
// where at four apps most of the screen will do.
static int menu_hit(int lx, int ly) {
    int rows = menu_rows();
    if (ly < 0) ly = 0;
    if (ly >= rows * MENU_CELL_H) return -1; // the cancel band
    int r = ly / MENU_CELL_H;
    int first, cols;
    menu_row_span(r, &first, &cols);
    int w = LAND_W / cols;
    if (lx < 0) lx = 0;
    int c = lx / w;
    if (c >= cols) c = cols - 1; // clamp into the row's last cell, which
                                  // absorbed LAND_W's remainder in
                                  // cell_rect_land()
    if (c < 0) c = 0;
    return first + c;
}

