s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
/* ---------------------------------------------------------------------
 * Icons: filled rectangles only, per this file's header comment. Each is
 * drawn into an ICON_W x ICON_H box at a given landscape origin.
 * ------------------------------------------------------------------- */

/* ---------------------------------------------------------------------
 * The chrono icon: THIRD PASS, 2026-08-14. The owner's verdict on round 2
 * (a plain annulus plus one crown flick, commit e8e1548 - the ring/wedge/
 * crown-rect/neck-rect/tab-diamond silhouette replaced rather than fixed):
 * "j'aimais bien celui qu'on avait avant" - he preferred the OLD icon,
 * still on the device at the time he judged this. The coordinator's read,
 * which holds up: the filled WEDGE is what said "a dial with something on
 * it"; a plain ring with a nub reads as a ring with a nub.
 *
 * So the old silhouette is back - ring, wedge, crown+neck, tab - but built
 * two ways round 1 never was:
 *
 *   - "des traits moins droits" (less straight lines): round 1's wedge had
 *     one dead-straight vertical edge, its crown+neck were two exact
 *     rectangles, and its tab was an exact diamond. All three are now
 *     HAND-WOBBLED constant tables instead - see tools/gen-chrono-icon.ts,
 *     which generates them from a seeded RNG smoothed through tldraw's own
 *     streamline pass (ingest(), tools/tldraw-freehand/core.ts - the
 *     vendored pipeline), the same technique gen-strokes.ts already uses
 *     to humanise Hershey letterforms. Baked as fixed constants rather
 *     than recomputed on device, the same call draw_icon_sketch's own
 *     fx/fy/fr waypoints already made: a wobble chosen once at design
 *     time, not a device-cycle expense.
 *   - "les pixels qui sortent" (the rule that also cost the hourglass its
 *     two floating grains): round 1's tab was held deliberately
 *     CHRONO_TAB_GAP px "clear of the ring" - it floated, touching
 *     nothing, on purpose. Rebuilt below as a short connected stroke
 *     chain whose BASE DISC is centred on the ring's own painted band
 *     (CHRONO_R_MID) - the exact join technique round 2's crown flick
 *     already proved (the base overlaps the ring's own solid ink before
 *     MIN composition ever has to decide anything, so there is no seam to
 *     trap), now used for both the crown and the tab.
 *
 * The ring itself is unchanged from round 2: shapes_fill_annulus_aa_land,
 * a true circle. It has no straight edge for "moins droits" to apply to
 * and it was never the part that floated.
 * ------------------------------------------------------------------- */
#define CHRONO_R_OUT       (ICON_W * 17 / 48)                    // 34
#define CHRONO_STROKE      10                                    // ring band width - "pretty thick"
#define CHRONO_R_IN        (CHRONO_R_OUT - CHRONO_STROKE)        // 24
#define CHRONO_R_MID       ((CHRONO_R_OUT + CHRONO_R_IN) / 2)    // 29, the ring's own centreline
#define CHRONO_CROWN_LEN   14                                    // crown path's own extent, see s_chronoCrownDy

// Crown tip to ring bottom, centred in ICON_H.
#define CHRONO_COMP_H (CHRONO_R_MID + CHRONO_CROWN_LEN + CHRONO_R_OUT) // 77

// Wedge: top-right quarter of the INNER disc (radius CHRONO_R_IN), apex at
// the ring's own centre - needs the inner circle's own per-row half-widths
// for its curved edge, same table shapes.h's own header comment says
// timer.c also depends on (shapes_fill_half_width_table itself is generic
// and stays regardless of what this file does with it).
static int16_t s_chronoHwInner[2 * CHRONO_R_OUT];
static bool s_chronoTablesReady = false;

static void ensure_chrono_tables(void) {
    if (s_chronoTablesReady) return;
    shapes_fill_half_width_table(s_chronoHwInner, 2 * CHRONO_R_OUT, (float)CHRONO_R_IN);
    s_chronoTablesReady = true;
}

// The wedge's one straight edge, hand-wobbled - tools/gen-chrono-icon.ts,
// seed 20260814. One entry per row of the wedge (CHRONO_R_OUT - rowStart
// rows; works out to 24 at today's CHRONO_R_OUT/CHRONO_R_IN), added to ccx
// in place of the old dead-straight `leftX[i] = ccx`. Indexed defensively
// in draw_icon_chrono() below in case CHRONO_R_OUT/CHRONO_R_IN are ever
// retuned without regenerating this table.
// REPLACED 2026-08-14 after the owner saw it rendered: "the part in the
// middle of the chronometer is fucking horrible". He was right, and the
// cause is worth writing down because it will recur.
//
// The generated wobble changed by one pixel from one row to the next, with
// six pixels of amplitude over twenty-four rows, and
// shapes_fill_between_curves_aa_land takes integer column arrays, so it has
// no sub-pixel edge to anti-alias against. A per-row jitter under those
// conditions cannot look like a hand: it can only look like a saw, which is
// exactly what it looked like. Randomness is not the same thing as
// handwriting, and at this scale it reads as a tear.
//
// STRAIGHT, and this is now a decision rather than the absence of one.
//
// The gentle arc that replaced the jitter was better and still wrong: the
// owner, looking at it magnified, said the middle "a l'air de s'effriter".
// It did. Six one-pixel steps is fewer than twenty, but on a curve this
// tight every one of them is a visible notch.
//
// The reason is structural and worth stating so nobody tries a third
// amplitude: shapes_fill_between_curves_aa_land takes INTEGER column arrays,
// so this edge has no sub-pixel position to anti-alias against. A perfectly
// vertical edge is the only one that produces no steps at all, because it
// never has to change column. Any deviation, of any size, quantises into a
// staircase.
//
// So the hand-drawn quality lives where the primitives can carry it, in the
// crown and tab (float capsules, genuinely anti-aliased) and in the sketch
// and coil icons. Not here. If this edge is ever to bow, it needs a fill
// that accepts float edges, not a smaller number.
static const int8_t s_chronoWedgeWobble[24] = {
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
};

// Crown path, hand-wobbled - tools/gen-chrono-icon.ts, same seed. Offsets
// from the base point (ccx, ccy - CHRONO_R_MID), +x right, +y down (this
// file's own landscape convention); the generator prints "+y = up" and
// this is its negation, already applied.
//
// SHORTENED after the first render (checked against the actual rendered
// PNG, not by eye on the numbers alone): at the original 20px reach with
// a taper down to a 2px point, this and the tab below read as two thin
// spikes off the top of the ring - "horns", not "a crown and a tab". See
// tools/gen-chrono-icon.ts's own "SHORTENED AND CALMED" comment for the
// shorter, gentler regeneration; draw_icon_chrono() below also stopped
// tapering either stroke all the way to a point, for the same reason.
#define CHRONO_CROWN_STEPS 6
static const float s_chronoCrownDx[CHRONO_CROWN_STEPS] = { 0.0f, -0.2f, -0.5f, -0.7f, -0.7f, -0.8f };
static const float s_chronoCrownDy[CHRONO_CROWN_STEPS] = { 0.0f, -2.7f, -5.4f, -8.1f, -10.9f, -13.6f };

// Tab path, hand-wobbled - tools/gen-chrono-icon.ts, same seed, same
// shortening as the crown above. Local frame: `along` is the outward
// radius direction at one-thirty (45 degrees clockwise from 12), `perp`
// is that direction rotated 90 degrees; s_chronoTabAlong/s_chronoTabPerp
// are the local (x, y) coordinates draw_icon_chrono() below projects into
// world space - `along` carries the reach (the large values), `perp` the
// small perpendicular wobble (a mislabelling of exactly this pair was
// caught and fixed in the same pass that shortened the reach: the first
// render's tab travelled mostly TANGENT to the ring instead of outward,
// because the generator's own printed column order - wobble first, reach
// second - had been transcribed into the wrong array).
#define CHRONO_TAB_STEPS 4
static const float s_chronoTabAlong[CHRONO_TAB_STEPS] = { 0.0f, 2.8f, 5.6f, 8.4f };
static const float s_chronoTabPerp[CHRONO_TAB_STEPS]  = { 0.0f, 0.2f, 0.4f, 0.5f };

static void draw_icon_chrono(int ox, int oy, uint16_t color) {
    ensure_chrono_tables();

    int top = oy + (ICON_H - CHRONO_COMP_H) / 2;
    int ccx = ox + ICON_W / 2;
    int ccy = top + CHRONO_R_MID + CHRONO_CROWN_LEN;
    float strokeHalf = (float)CHRONO_STROKE / 2.0f; // 5 - both the ring's own half-width and the
                                                       // radius every stroke below starts at, so
                                                       // every base disc sits inside the ring's ink

    // Dial: a true circular annulus, both edges anti-aliased, analytic -
    // no per-row table needed at all.
    shapes_fill_annulus_aa_land((float)ccx, (float)ccy, (float)CHRONO_R_OUT, (float)CHRONO_R_IN, color);

    // Wedge: top-right quarter of the inner disc, apex at the ring's own
    // centre - back from round 1, its curved edge from s_chronoHwInner
    // (padded outward by one pixel past the ring's own inner edge, the
    // same seam trap round 1 needed - two independent AA computations of
    // the "same" circle round to different sub-pixel edges otherwise, and
    // the ring's own AA fringe peeks through as scattered grey dots along
    // the seam), its straight edge now s_chronoWedgeWobble instead of a
    // constant ccx.
    {
        // PAINTED, not filled. Owner, drawing the shape he wanted straight
        // onto a magnified render: the L-shaped corner is "trop droite par
        // rapport au reste du dessin", and his line shows the two edges
        // bowing and the inner corner rounding off.
        //
        // The row fill could not do that at any amplitude, for the reason
        // recorded above s_chronoWedgeWobble: integer columns, no sub-pixel
        // edge, every deviation quantises into a staircase. So the wedge is
        // now swept with the float capsule primitive instead, the same brush
        // sketch.c draws with. Capsules from the apex out to the rim, one per
        // small angular step, merged by MIN composition into one mass.
        //
        // Three things fall out of that and all three are the point. Every
        // edge is genuinely anti-aliased, because the capsule is. The inner
        // corner is round by construction, since it is the apex cap. And the
        // radial edges can bow, because nothing here is quantised to a
        // column any more.
        //
        // Cost is about ninety capsule calls, paid once when the menu opens,
        // not per frame.
        const float wedgeR = (float)CHRONO_R_IN + 1.0f; // +1: the same seam overlap the row fill needed
        const float apexR = 4.0f;   // rounds the inner corner
        const float rimR = 1.6f;    // keeps the swept edge solid between steps
        const int wedgeSteps = 90;
        for (int i = 0; i <= wedgeSteps; i++) {
            float t = (float)i / (float)wedgeSteps;      // 0 at 12 o'clock, 1 at 3 o'clock
            float a = t * 90.0f * 3.14159265f / 180.0f;
            float x1 = (float)ccx + wedgeR * sinf(a);
            float y1 = (float)ccy - wedgeR * cosf(a);
            shapes_fill_capsule_aa_land((float)ccx, (float)ccy, apexR, x1, y1, rimR, color);
        }

        // The two radial edges, bowed outward. Kept as a separate pass on
        // purpose: an earlier attempt bowed the sweep itself by rotating each
        // capsule, which needed the rotation to change sign at the midpoint
        // and therefore left an eight degree wedge with no capsule in it at
        // all. Filling and outlining are two jobs, and one primitive doing
        // both is how that gap got in.
        //
        // A quadratic with its control point pushed perpendicular to the edge
        // is the bow. MIN composition merges these into the swept mass, so
        // the result is one piece of ink with slightly curved sides rather
        // than a shape with a stroke drawn around it.
        {
            const float bowPx = 3.0f;  // THE KNOB for how much the sides curve
            float rim = wedgeR;
            // Edge A: apex straight up to 12 o'clock, bowing left.
            shapes_fill_tapered_quad_aa_land((float)ccx, (float)ccy, apexR,
                                             (float)ccx - bowPx, (float)ccy - rim * 0.5f,
                                             (float)ccx, (float)ccy - rim, rimR, color);
            // Edge B: apex straight right to 3 o'clock, bowing down.
            shapes_fill_tapered_quad_aa_land((float)ccx, (float)ccy, apexR,
                                             (float)ccx + rim * 0.5f, (float)ccy + bowPx,
                                             (float)ccx + rim, (float)ccy, rimR, color);
        }
    }

    // Crown: a hand-wobbled stroke chain, base centred ON the ring's own
    // painted band so the join is unconditional (see this block's header
    // comment) - CHRONO_CROWN_STEPS-1 segments instead of round 2's one
    // straight flick. Tapers strokeHalf -> 3.5px, NOT to a point: a taper
    // all the way down is what made the first render's crown read as a
    // thin spike rather than a knob (see s_chronoCrownDx's own comment).
    {
        float baseX = (float)ccx, baseY = (float)ccy - (float)CHRONO_R_MID;
        float prevX = baseX, prevY = baseY, prevR = strokeHalf;
        for (int i = 1; i < CHRONO_CROWN_STEPS; i++) {
            float x = baseX + s_chronoCrownDx[i];
            float y = baseY + s_chronoCrownDy[i];
            float r = strokeHalf + (3.5f - strokeHalf) * (float)i / (float)(CHRONO_CROWN_STEPS - 1);
            shapes_fill_capsule_aa_land(prevX, prevY, prevR, x, y, r, color);
            prevX = x; prevY = y; prevR = r;
        }
    }

