s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
    // Tab: round 1's diamond, held deliberately "clear of the ring" - the
    // exact floating mark the owner named this pass ("les pixels qui
    // sortent"). Rebuilt as a short connected, hand-wobbled stroke chain:
    // base ON the ring's own band at one-thirty, same join technique as
    // the crown above, tip out near where the old tab sat. Tapers
    // strokeHalf -> 3px, same "not to a point" reasoning as the crown.
    {
        float alongX = 0.70710678f, alongY = -0.70710678f; // one-thirty, clockwise from 12
        float perpX = 0.70710678f, perpY = 0.70710678f;    // `along` rotated 90 degrees
        float baseX = (float)ccx + alongX * (float)CHRONO_R_MID;
        float baseY = (float)ccy + alongY * (float)CHRONO_R_MID;
        float prevX = baseX, prevY = baseY, prevR = strokeHalf;
        for (int i = 1; i < CHRONO_TAB_STEPS; i++) {
            float x = baseX + alongX * s_chronoTabAlong[i] + perpX * s_chronoTabPerp[i];
            float y = baseY + alongY * s_chronoTabAlong[i] + perpY * s_chronoTabPerp[i];
            float r = strokeHalf + (3.0f - strokeHalf) * (float)i / (float)(CHRONO_TAB_STEPS - 1);
            shapes_fill_capsule_aa_land(prevX, prevY, prevR, x, y, r, color);
            prevX = x; prevY = y; prevR = r;
        }
    }
}

/* ---------------------------------------------------------------------
 * The DRAW icon: a fast freehand squiggle, per the owner's sketch
 * (icon-draw2.png) and their follow-up correction in words: it must travel
 * top-left to bottom-right across the box, and it must look drawn, not
 * constructed - the test the owner set is literal ("does it look like
 * something a person drew quickly, or like a symbol someone built").
 *
 * A first version drew this as a straight-segment polyline (built from what
 * was then shapes_fill_thick_segment_land, a plain fixed-thickness stamped
 * diagonal - deleted along with the rest of shapes.h's first generation
 * once every caller in this file moved to anti-aliased primitives; see
 * shapes.h's header comment) and failed that test twice: once because its
 * corners sat within a few degrees of dead vertical/horizontal and read as
 * a lightning bolt, and again, after hand-tuning the angles, because
 * straight segments at a constant 12px thickness read as a deliberate "Z"
 * rather than ink - a chain of facets is still a chain of facets no matter
 * how their angles are chosen. What was missing was curvature and taper,
 * not better corners.
 *
 * Both come from firmware/apps/sketch.c, which solved this exact problem
 * for the live pen tool:
 *
 *   - CURVE: sketch.c's draw_quad_midpoint() replaces each straight facet
 *     between three consecutive points with a quadratic Bezier through
 *     their midpoints, so consecutive curve segments meet exactly at a
 *     shared midpoint and the whole path reads as one continuous curve.
 *     shapes_fill_tapered_quad_aa_land() below is that same construction as
 *     a reusable shapes.h helper, anti-aliased circles now rather than
 *     rectangle stamps (see shapes.h's header comment: this whole file
 *     used to draw everything as rectangles, which is exactly what read as
 *     a staircase rather than ink); this function calls it once per
 *     interior waypoint (P1, P2, P3), each time with that waypoint as the
 *     control point and the midpoints on either side of it as the
 *     segment's own endpoints - see shapes.c's header comment on
 *     shapes_fill_tapered_quad_aa_land for exactly how that chains.
 *     P0->first-midpoint and last-midpoint->P4 are drawn straight (with
 *     shapes_fill_capsule_aa_land), the same lead-in/lead-out
 *     sketch.c's stroke_begin()/stroke_end() use before enough history
 *     exists for a curve.
 *
 *   - TAPER: sketch.c's pressure model varies the pen radius continuously
 *     (thin at a stroke's start and end, fullest through a fast middle).
 *     There is no touch speed to read here, so the five waypoints below
 *     each carry a fixed radius instead - thin (2px) at P0, ramping up to
 *     fullest (4px) at P2, back down to thin (1px, deliberately narrower
 *     than the start - an asymmetric taper reads more like a hand lifting
 *     the pen than a symmetric one) at P4 - and
 *     shapes_fill_tapered_quad_aa_land/shapes_fill_capsule_aa_land
 *     interpolate between those linearly along the path, the same way
 *     draw_capsule interpolates r0->r1 across sketch.c's own spans.
 *
 * A second pass at these numbers (curve and taper both already in place)
 * still failed the owner's test: at a peak HALF-width of 8px the stroke
 * was 16px thick, a sixth of the icon's own width, and the wiggles sat
 * close enough together that consecutive passes touched and merged into
 * one mass - a squiggle only reads as a squiggle because of the white
 * BETWEEN its passes, and there was almost none. This device's real pen is
 * 5px wide (sketch.c's PEN_SIZE); an icon representing it at 16px was also
 * just wrong. Fixed with both levers at once: the peak half-width dropped
 * to 4px (this device's own pen, roughly, rather than something invented
 * for the icon), and the waypoints below were pushed out to use the whole
 * box - P1 and P3 now sit within a few px of the right edge, P0 and P2
 * within a few px of the left - which is what actually buys the white:
 * a thinner stroke alone does nothing if the passes still overlap. Checked
 * by scanning the rendered framebuffer, not by eye - a vertical line
 * through the icon's centre column, at 1x, crosses the stroke three times
 * on its way down and gives run lengths (top to bottom, W=white/B=black,
 * px) of W11 B5 W11 B8 W19 B7 W35: every white gap (11px, then 19px) comes
 * out wider than the ink on either side of it (5-8px), 1.4x to 3.8x over,
 * not just barely clearing the bar.
 *
 * The five waypoints are otherwise unchanged in spirit from the earlier
 * versions: unequal wiggle amplitudes and unequal segment lengths on
 * purpose (a regular zigzag reads as a waveform, not a hand), travelling
 * top-left to bottom-right. Fractions of ICON_W/ICON_H (0..100), not
 * literal pixel counts, so the glyph rescales if the tile geometry above
 * ever changes; the radii are left as plain pixel counts, same as every
 * other icon's stroke widths in this file, since ICON_W/ICON_H are 96 in
 * every build this device ships (see the chrono icon's header comment on
 * the same choice).
 * ------------------------------------------------------------------- */
static void draw_icon_sketch(int ox, int oy, uint16_t color) {
    static const int fx[5] = { 8, 90, 8, 92, 84 };
    static const int fy[5] = { 8, 20, 48, 72, 94 };
    static const int fr[5] = { 2, 3, 4, 3, 1 };
    int px[5], py[5], pr[5];
    for (int i = 0; i < 5; i++) {
        px[i] = ox + fx[i] * ICON_W / 100;
        py[i] = oy + fy[i] * ICON_H / 100;
        pr[i] = fr[i];
    }

