s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
static int16_t s_timerBulbHw[TIMER_CHAMBER_H]; // row 0 = cap (wide), last = waist (narrow)
static bool s_timerBulbReady = false;

static void ensure_timer_bulb_table(void) {
    if (s_timerBulbReady) return;

    // hw(row) = A*sqrt(1 - ((row-P)/B)^2), P = TIMER_BULB_PEAK_ROW fixed.
    // Squaring the two endpoint conditions (hw(0) = TIMER_HALF_OUT,
    // hw(m) = TIMER_HALF_NECK, m = TIMER_CHAMBER_H-1) and subtracting
    // cancels the A^2/B^2 cross term down to one unknown, v = A^2/B^2; A
    // and B follow from there. See this block's header comment for why
    // this replaces a single circle (which cannot decouple the bulge's
    // width from how many rows it takes to reach it, and so cannot place
    // its own peak inside the window without an invisible, sub-pixel
    // bulge).
    float outF = (float)TIMER_HALF_OUT, neckF = (float)TIMER_HALF_NECK;
    float p = (float)TIMER_BULB_PEAK_ROW;
    float m = (float)(TIMER_CHAMBER_H - 1);

    float v = (outF * outF - neckF * neckF) / ((m - p) * (m - p) - p * p);
    float aSq = outF * outF + v * p * p;
    float a = sqrtf(aSq);
    float b = sqrtf(aSq / v);

    // ICON_W/2 - 1: the icon's own box edge, a hard safety clamp so a
    // future change to TIMER_BULB_PEAK_ROW or the chamber's proportions
    // cannot silently draw the bulge's peak past the icon's own bounding
    // box instead of just making it visibly too fat (an obvious bug, not a
    // corrupted one).
    int maxHw = ICON_W / 2 - 1;

    for (int row = 0; row < TIMER_CHAMBER_H; row++) {
        float dy = (float)row - p;
        float t = dy / b;
        float underRoot = 1.0f - t * t;
        float hwF = underRoot > 0.0f ? a * sqrtf(underRoot) : 0.0f;
        int16_t hw = (int16_t)(hwF + 0.5f);
        if (hw < TIMER_HALF_NECK) hw = TIMER_HALF_NECK; // guards the waist
                                                          // end against
                                                          // float rounding
                                                          // only - the
                                                          // algebra targets
                                                          // this exactly.
        if (hw > maxHw) hw = maxHw;
        s_timerBulbHw[row] = hw;
    }
    s_timerBulbReady = true;
}

// RENDERING: anti-aliased (shapes.h's second generation). BOTH bulbs are
// GLASS - a stroke of the same weight, TIMER_OUTLINE wide, marched along
// s_timerBulbHw's curve with shapes_fill_capsule_aa_land (chained so a
// capsule's own round cap keeps consecutive stamps merged into one
// continuous band, the same argument shapes_fill_capsule_aa_land's own
// header comment makes - right past the waist this curve's own half-width
// can jump more per row than TIMER_OUTLINE is wide, and a bar drawn only
// at each row's own x, with nothing bridging to the next row's, breaks the
// outline into visible dashes exactly there, confirmed on an old, non-AA
// version of this icon - see git history). The two bulbs are mirror images
// of the same table (row 0 = cap/wide, last row = waist/narrow - see
// MIRROR SYMMETRY above): the top chamber walks it forwards from the cap,
// the bottom walks it backwards from the waist, same table either way.
//
// THE OVERFLOW FIX applies to BOTH bulbs now, not just the bottom: a
// stroke's rounded end sticks out past its own last sample point by the
// stroke's own half-width, the same way any capsule's round cap always
// does. Marching a curve all the way to its own cap row would let that
// overhang poke straight through TIMER_MARGIN (measured on an earlier,
// bottom-only version of this fix: top margin exactly TIMER_MARGIN=2px
// while the top chamber was still a flat fill with no overhang to cause
// this, bottom margin only 1px where it already was a stroke - an
// asymmetry with nothing conceptual behind it, just this overhang). Both
// bulbs now march their curve FROM the waist (safely mid-icon, never near
// a margin) TOWARD their own cap, stopping outlineR rows short so the
// round end always lands ON the flat cap rectangle rather than past it;
// the flat cap itself (unchanged position/size either way) covers the
// reserved gap. Checked on the rendered framebuffer, not by eye: with this
// fix, both margins come out TIMER_MARGIN, symmetric.
static void draw_icon_timer(int ox, int oy, uint16_t color) {
    ensure_timer_bulb_table();

    int cx = ox + ICON_W / 2;
    int top = oy + TIMER_MARGIN;
    int outlineR = TIMER_OUTLINE / 2; // 2, TIMER_OUTLINE is even; both the
                                       // stroke's half-width AND the row
                                       // budget reserved at each bulb's own
                                       // cap end - see THE OVERFLOW FIX.
    int curveRows = TIMER_CHAMBER_H - outlineR;

    // ---- TOP bulb: the glass. Flat cap first (axis-aligned, the sealed
    // rim - a hard edge on purpose, nothing to anti-alias), then the
    // curved sides marched from the waist up toward the cap.
    gfx_fill_rect_land(cx - TIMER_HALF_OUT, top, 2 * TIMER_HALF_OUT, TIMER_OUTLINE, color);
    {
        float prevHw = (float)s_timerBulbHw[TIMER_CHAMBER_H - 1]; // the waist
        float prevY = (float)(top + TIMER_CHAMBER_H - 1);
        for (int step = 1; step < curveRows; step++) {
            int tableRow = TIMER_CHAMBER_H - 1 - step; // walking the table
                                                         // backwards, waist
                                                         // toward cap
            float hw = (float)s_timerBulbHw[tableRow];
            float y = (float)(top + tableRow);
            shapes_fill_capsule_aa_land(cx - prevHw, prevY, (float)outlineR,
                                         cx - hw, y, (float)outlineR, color);
            shapes_fill_capsule_aa_land(cx + prevHw, prevY, (float)outlineR,
                                         cx + hw, y, (float)outlineR, color);
            prevHw = hw;
            prevY = y;
        }
    }

    /* -----------------------------------------------------------------
     * THE SAND. A separate, solid shape sitting INSIDE the top bulb's
     * glass - not the bulb's own fill, and not filled to the brim: it
     * occupies roughly the lower half to two thirds of the chamber
     * (measured from the waist up), per the reference. sandDepthRows is
     * that fraction of TIMER_CHAMBER_H; rowSandTop is the table row (in
     * the top chamber's own row-0-is-cap convention) where the sand
     * begins.
     *
     * The sand's own top surface is not flat: sand settles into a shallow
     * CONE as it drains through the neck, higher against the glass walls
     * than in the middle, so the surface DIPS toward the centre - a
     * crater, not a table top. In cross-section that means, for the rows
     * right at the top of the sand, there are TWO separate spans of sand
     * (a sliver against the left wall, a sliver against the right wall)
     * with a gap between them, rather than one span across the full
     * width; the gap narrows going down (dipRows of it) until the two
     * slivers meet and the rest of the sand, down to the waist, is solid
     * full width. shapes_fill_between_curves_aa_land only ever fills ONE
     * span per row, so the two-sliver zone is drawn as two separate calls
     * (left blob, right blob) rather than one - everything below the dip
     * is the ordinary one-call mirrored fill the whole bulb used to use.
     * ----------------------------------------------------------------- */
    int sandDepthRows = TIMER_CHAMBER_H * 3 / 5; // ~60%: "half to two thirds"
    int rowSandTop = TIMER_CHAMBER_H - sandDepthRows;
    int sandInset = outlineR; // sand sits just inside the glass stroke's
                               // own inner edge - touching it, not past it
    int dipRows = 5;          // shallow on purpose: a handful of rows out
                               // of sandDepthRows (~26), or this reads as
                               // a bowl, not a dusting of settling sand
    if (dipRows > sandDepthRows) dipRows = sandDepthRows;

    int16_t sLeft[TIMER_CHAMBER_H], sRight[TIMER_CHAMBER_H];

    if (dipRows > 1) {
        int sandHwAtTop = s_timerBulbHw[rowSandTop] - sandInset;
        if (sandHwAtTop < 0) sandHwAtTop = 0;
        // How much sand shows at the very peak of the dip, against each
        // wall: small enough to read as a sliver, wide enough (with its
        // own AA fringe) not to be the "petit pixel nul" this whole file
        // exists to avoid.
        int sliverPx = 2;
        int maxCutout = sandHwAtTop - sliverPx;
        if (maxCutout < 0) maxCutout = 0;

