s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
        // Left sliver, growing inward (its own RIGHT edge is the dip's
        // moving boundary) as the row index increases.
        for (int i = 0; i < dipRows; i++) {
            int hw = s_timerBulbHw[rowSandTop + i] - sandInset;
            if (hw < 0) hw = 0;
            int cutout = maxCutout * (dipRows - 1 - i) / (dipRows - 1); // maxCutout -> 0
            if (cutout > hw) cutout = hw;
            sLeft[i] = (int16_t)(cx - hw);
            sRight[i] = (int16_t)(cx - cutout);
        }
        shapes_fill_between_curves_aa_land(top + rowSandTop, dipRows, sLeft, sRight, color);

        // Right sliver, the mirror.
        for (int i = 0; i < dipRows; i++) {
            int hw = s_timerBulbHw[rowSandTop + i] - sandInset;
            if (hw < 0) hw = 0;
            int cutout = maxCutout * (dipRows - 1 - i) / (dipRows - 1);
            if (cutout > hw) cutout = hw;
            sLeft[i] = (int16_t)(cx + cutout);
            sRight[i] = (int16_t)(cx + hw);
        }
        shapes_fill_between_curves_aa_land(top + rowSandTop, dipRows, sLeft, sRight, color);
    } else {
        dipRows = 0; // degenerate case (a tiny chamber): no room for a
                     // dip at all, fall straight through to the solid fill
                     // below.
    }

    // Below the dip: solid, full width (inset from the glass), down to
    // the waist - what connects the sand to the neck and to the falling
    // grains, and what makes it read as sand SITTING in the glass rather
    // than floating.
    {
        int fullRows = TIMER_CHAMBER_H - (rowSandTop + dipRows);
        for (int i = 0; i < fullRows; i++) {
            int row = rowSandTop + dipRows + i;
            int hw = s_timerBulbHw[row] - sandInset;
            if (hw < 0) hw = 0;
            sLeft[i] = (int16_t)(cx - hw);
            sRight[i] = (int16_t)(cx + hw);
        }
        shapes_fill_between_curves_aa_land(top + rowSandTop + dipRows, fullRows, sLeft, sRight, color);
    }

    // Neck: a short solid connector, already axis-aligned. It closes the
    // bottom of the sand and the top of the empty chamber in the same
    // rectangle, which is what gives the glass a pinch point instead of
    // two chambers meeting at a single pixel.
    int neckY = top + TIMER_CHAMBER_H;
    gfx_fill_rect_land(cx - TIMER_HALF_NECK, neckY, 2 * TIMER_HALF_NECK, TIMER_NECK_H, color);

    // ---- BOTTOM bulb: the glass, mirrored - empty, nothing has fallen
    // yet. Its own row 0 (right below the neck) is the NARROW end, so it
    // reads s_timerBulbHw in reverse (index TIMER_CHAMBER_H-1-row), same
    // table the top bulb used, just walked the other way; same march,
    // same overflow reservation, same flat cap treatment as the top bulb
    // above (see this block's header comment for both).
    int bottomTop = neckY + TIMER_NECK_H;
    {
        float prevHw = (float)s_timerBulbHw[TIMER_CHAMBER_H - 1]; // this chamber's own row 0 (waist)
        float prevY = (float)bottomTop;
        for (int row = 1; row < curveRows; row++) {
            float hw = (float)s_timerBulbHw[TIMER_CHAMBER_H - 1 - row];
            float y = (float)(bottomTop + row);
            shapes_fill_capsule_aa_land((float)cx - prevHw, prevY, (float)outlineR,
                                         (float)cx - hw, y, (float)outlineR, color);
            shapes_fill_capsule_aa_land((float)cx + prevHw, prevY, (float)outlineR,
                                         (float)cx + hw, y, (float)outlineR, color);
            prevHw = hw;
            prevY = y;
        }
    }
    gfx_fill_rect_land(cx - TIMER_HALF_OUT, bottomTop + TIMER_CHAMBER_H - TIMER_OUTLINE,
                        2 * TIMER_HALF_OUT, TIMER_OUTLINE, color);

    // REMOVED 2026-08-14: two individual grain discs used to float here,
    // a few pixels below the neck and touching nothing - exactly the
    // "loose grain of sand" the owner named directly this pass ("no
    // spare pixel... no stray pixel", the hourglass called out by name).
    // They read as connected only by proximity, not by any actual shared
    // ink with the sand mass above or the heap below - the one shape in
    // this icon shapes.h's MIN-composition argument does not save,
    // because a lone disc has nothing to composite AGAINST. The heap
    // just below (see next) already carries "grains have landed" without
    // a floating mark to do it.

    // A small heap where the fallen grains would be landing, tried rather
    // than assumed either way (see this file's task history): four rows,
    // narrowest at its own peak and widest at its base, sitting just above
    // the bottom cap. Kept because it still reads as a heap at 1x, not a
    // smear - see the task report for the framebuffer check.
    {
        static const int16_t heapHw[4] = {1, 2, 3, 4};
        int heapRows = 4;
        int heapTop = bottomTop + TIMER_CHAMBER_H - TIMER_OUTLINE - heapRows;
        int16_t hl[4], hr[4];
        for (int i = 0; i < heapRows; i++) {
            hl[i] = (int16_t)(cx - heapHw[i]);
            hr[i] = (int16_t)(cx + heapHw[i]);
        }
        shapes_fill_between_curves_aa_land(heapTop, heapRows, hl, hr, color);
    }
}

/* ---------------------------------------------------------------------
 * PROPOSED ALTERNATIVE timer icon, 2026-08-14: a coil, not an hourglass.
 * The owner has never liked the hourglass and this pass asked whether it
 * is even the right object - a fair question now that the timer app
 * itself no longer shows one anywhere: it is a coil dial that winds like
 * a hose (docs/decisions/0002-runtime-architecture.md, "the coil"). This
 * icon draws that same idea small - a spiral winding inward, the same
 * "winding inward so the outer diameter never grows" language the real
 * dial's own header comment uses - rather than inventing a second,
 * unrelated pictogram for "waiting".
 *
 * ONE continuous ink stroke, by construction rather than by discipline: a
 * single chain of shapes_fill_capsule_aa_land calls marched along a
 * spiral parametric curve (COIL_POINTS samples, COIL_TURNS turns,
 * radius linear from COIL_R_OUTER down to COIL_R_INNER), each call's
 * start point the previous call's end point exactly - the same
 * shared-endpoint argument shapes_fill_tapered_quad_aa_land's own header
 * comment makes for why a chain built this way reads as one curve, not a
 * set of facets. Width follows a sine hump (COIL_W_MIN at both ends,
 * COIL_W_MAX at the middle turn) - the same asymmetric-taper spirit
 * draw_icon_sketch's own header comment argues for, thin where the pen
 * would be leaving or arriving, thick mid-stroke. There is no second
 * shape for this icon to connect to anything: the "no stray pixel" rule
 * is satisfied trivially, not by discipline, which is part of the case
 * for it over the hourglass.
 *
 * COIL_TWO_PI/COIL_PI are spelled out rather than pulled from math.h's
 * M_PI, which is not guaranteed available under -std=c11 on every
 * toolchain this file builds under (the board's arm-none-eabi-gcc and
 * zig's wasm32-freestanding target, see docs/decisions/0003) - the same
 * reasoning CHRONO_TAB_OFF used to use to avoid sinf/cosf, in reverse:
 * here the angle genuinely varies per point, so the runtime call is the
 * right tool, but the constant it needs should not depend on a macro
 * some toolchains define behind a feature-test flag and some do not.
 * ------------------------------------------------------------------- */
#define COIL_PI       3.14159265359f
#define COIL_TWO_PI   6.28318530718f
#define COIL_TURNS    2.25f
#define COIL_R_OUTER  40
#define COIL_R_INNER  6
#define COIL_POINTS   72
#define COIL_W_MAX    5.0f  // matches CHRONO_CROWN_BASE_R: same hand, same weight
#define COIL_W_MIN    1.5f

static void draw_icon_timer_coil(int ox, int oy, uint16_t color) {
    int ccx = ox + ICON_W / 2;
    int ccy = oy + ICON_H / 2;

    float prevX = 0.0f, prevY = 0.0f, prevW = 0.0f;
    for (int i = 0; i < COIL_POINTS; i++) {
        float t = (float)i / (float)(COIL_POINTS - 1);
        float theta = t * COIL_TURNS * COIL_TWO_PI;
        float r = (float)COIL_R_OUTER + ((float)COIL_R_INNER - (float)COIL_R_OUTER) * t;
        float x = (float)ccx + r * sinf(theta);
        float y = (float)ccy - r * cosf(theta);
        float w = COIL_W_MIN + (COIL_W_MAX - COIL_W_MIN) * sinf(COIL_PI * t);

        if (i > 0) {
            shapes_fill_capsule_aa_land(prevX, prevY, prevW, x, y, w, color);
        }
        prevX = x; prevY = y; prevW = w;
    }
}

// Which timer icon actually paints. Flip to 1 once the owner has picked
// between draw_icon_timer() (the cleaned-up hourglass) and
// draw_icon_timer_coil() above, then delete whichever function this
// stops calling - both are kept compiled for now only so the emulator
// can render either one on request while the choice is open.
// 1 since 2026-08-14: the owner chose the coil over the hourglass. It is one
// continuous stroke, so "no stray pixel" holds by construction rather than by
// vigilance, and the timer has not shown an hourglass since it became a wound
// dial that morning. The hourglass stays compiled and one edit away.
#define TIMER_ICON_USE_COIL 1

/* =======================================================================
 * LUCIDE-DERIVED CANDIDATES, 2026-08-14. The owner's direction, which
 * replaces every icon rather than refining what is there: "essayez de
 * redessiner nos icones de zero en utilisant Lucide" - the icon language
 * behind the Cursor set he referenced, ISC licensed, vendored at
 * third_party/lucide/ (see that directory's own README.md for exactly
 * which files and why, and LICENSE for the licence text the ISC terms
 * require to travel with the source).
 *
 * CONVERSION, NOT TRACING. Lucide icons are exactly the vocabulary
 * shapes.h already speaks: <circle> is shapes_fill_annulus_aa_land, and
 * every <line>/<path> is a chain of round-capped, CONSTANT-width
 * segments - shapes_stroke_polyline_aa_land (new this pass, see shapes.h;
 * it is shapes_fill_tapered_quad_aa_land's own chaining argument without
 * the taper, since Lucide never tapers). tools/lucide-convert.ts parses
 * each vendored SVG's <line>/<circle>/<path> (M/L/H/V/A/Z, flattening
 * arcs to points) and tools/gen-lucide-menu-icons.ts prints the point
 * arrays below - generated, then hand-pasted, the same discipline every
 * other baked-constant table in this file already uses (draw_icon_sketch's
 * fx/fy/fr, the chrono icon's hand-wobble tables): a design decision made
 * once, not a build-time dependency on a third file.
 *
 * SCALE: Lucide's own viewBox is always 24x24 at a 2px stroke; this
 * device's icon box is 96x96, so 4x lands every coordinate exactly on
 * this file's own ICON_W/ICON_H, and the FAITHFUL conversion is therefore
 * 2px*4=8px (LUCIDE_STROKE_HALF=4.0f) - close to the chrono ring's old
 * 10px band, which is why it was expected to land naturally. This is
 * exactly the legibility question the coordinator raised before anything
 * was rendered: Lucide lives at 16px in an IDE with a thin line, this icon
 * lives at 96px read by a child who cannot read yet - a thin outline can
 * say "precision tool" where this device wants "object". LUCIDE_STROKE_HALF
 * is set to 5.0f (10px) below, heavier than the faithful conversion,
 * because the design-time approximate raster (tools/gen-lucide-menu-icons.ts,
 * NOT anti-aliased, NOT the real firmware) already looked thin at 4.0f
 * side by side with the ring/coil's own boldness - but that is a
 * quick-iteration tool's opinion, not the real panel's. See this pass's
 * own report for what the pixel-accurate wasm-emulator capture actually
 * showed at both weights, and whether 5.0f was the right call or needed
 * a further pass.
 *
 * NEITHER SET IS WIRED AS THE DEFAULT. draw_icon_for() below still
 * paints the current shipped icons; the *_ICON_LUCIDE defines are 0
 * (off) until the owner has looked at the preview and chosen - see this
 * pass's own report for the PNGs and which candidate is recommended
 * where more than one was rendered.
 * ----------------------------------------------------------------------
 * NAMING NOTE, worth having in mind reading the constant names below:
 * Lucide's own icon called "timer" is shaped like what THIS device calls
 * chrono (a stopwatch - a dial, a crown, a hand), and Lucide has no icon
 * for this device's timer app's own coil dial at all. The match below is
 * by SILHOUETTE, never by Lucide's own filename - s_lucideChronoTimer*
 * draws from timer.svg because chrono is the stopwatch, not because the
 * names happen to agree.
 * ======================================================================= */
#define LUCIDE_STROKE_HALF 5.0f

