s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
static void draw_icon_lucide_sketch_pencil(int ox, int oy, uint16_t color) {
    float dx = (float)ox, dy = (float)oy;
    float bx[69], by[69];
    for (int i = 0; i < 69; i++) { bx[i] = dx + s_lucidePencilBodyX[i]; by[i] = dy + s_lucidePencilBodyY[i]; }
    shapes_stroke_polyline_aa_land(bx, by, 69, LUCIDE_STROKE_HALF, color);
    float tx[2] = { dx + s_lucidePencilTickX[0], dx + s_lucidePencilTickX[1] };
    float ty[2] = { dy + s_lucidePencilTickY[0], dy + s_lucidePencilTickY[1] };
    shapes_stroke_polyline_aa_land(tx, ty, 2, LUCIDE_STROKE_HALF, color);
}

static const float s_lucidePencilLineMarkX[2] = { 52.00f, 84.00f };
static const float s_lucidePencilLineMarkY[2] = { 84.00f, 84.00f };

static void draw_icon_lucide_sketch_pencilline(int ox, int oy, uint16_t color) {
    draw_icon_lucide_sketch_pencil(ox, oy, color);
    float dx = (float)ox, dy = (float)oy;
    float mx[2] = { dx + s_lucidePencilLineMarkX[0], dx + s_lucidePencilLineMarkX[1] };
    float my[2] = { dy + s_lucidePencilLineMarkY[0], dy + s_lucidePencilLineMarkY[1] };
    shapes_stroke_polyline_aa_land(mx, my, 2, LUCIDE_STROKE_HALF, color);
}

// ---- timer candidates: hourglass.svg and loader-circle.svg. NAMING THE
// TRADE the owner asked not to drop silently: Lucide has nothing shaped
// like a wound coil - the real dial is this device's own invention, not
// a stock pictogram, so nothing in Lucide's set can be faithful to it.
// hourglass.svg is the classic, universally-read "waiting" symbol (a
// child does not need to have used a coil timer to read it, unlike
// loader-circle.svg); loader-circle.svg is Lucide's own spinner glyph -
// an open ring, one continuous stroke - which is a WEAKER symbol on its
// own (spinners mean "loading", not "counting down") but is honestly the
// closer relative of the two to what the real dial actually IS (a
// partial ring that fills as it winds). Both rendered; recommend
// hourglass for legibility a child needs no context to read, but say so
// rather than pick quietly - the coil itself is not represented either
// way, and that loss is real, not papered over by either choice.
static const float s_lucideHourglassCapTopX[2] = { 20.00f, 76.00f };
static const float s_lucideHourglassCapTopY[2] = { 8.00f, 8.00f };
static const float s_lucideHourglassCapBotX[2] = { 20.00f, 76.00f };
static const float s_lucideHourglassCapBotY[2] = { 88.00f, 88.00f };
// Lucide's own hourglass is NOT a rounded two-bulb shape like this device's
// hand-drawn one - it is two flat "V"/"^" wedges, each entirely on its own
// side of the waist: the BOTTOM wedge runs corner-to-waist-to-corner along
// the bottom cap only (y in [48,88], never reaching the top), the TOP
// wedge the mirror. First transcription of these two arrays swapped which
// array's SECOND half belonged to which, splicing the bottom wedge's own
// first half onto the top wedge's second half - caught only by rendering
// it (a lightning-bolt "S" instead of a bowtie X) and re-verified against
// tools/gen-lucide-menu-icons.ts's own fresh output, not by re-reading the
// numbers harder. Worth the reminder: bounds-checking a baked table means
// checking it stays ON ITS OWN SIDE of a shared point like the waist, not
// just checking its first few entries look plausible.
static const float s_lucideHourglassBottomWedgeX[37] = { 68.00f, 68.00f, 67.99f, 67.96f, 67.91f, 67.85f, 67.76f, 67.66f, 67.53f, 67.39f, 67.23f, 67.05f, 66.86f, 66.65f, 66.42f, 66.18f, 65.93f, 65.66f, 48.00f, 30.34f, 30.07f, 29.82f, 29.58f, 29.35f, 29.14f, 28.95f, 28.77f, 28.61f, 28.47f, 28.34f, 28.24f, 28.15f, 28.09f, 28.04f, 28.01f, 28.00f, 28.00f };
static const float s_lucideHourglassBottomWedgeY[37] = { 88.00f, 71.31f, 70.92f, 70.53f, 70.14f, 69.75f, 69.37f, 68.99f, 68.62f, 68.25f, 67.89f, 67.54f, 67.20f, 66.87f, 66.55f, 66.24f, 65.94f, 65.66f, 48.00f, 65.66f, 65.94f, 66.24f, 66.55f, 66.87f, 67.20f, 67.54f, 67.89f, 68.25f, 68.62f, 68.99f, 69.37f, 69.75f, 70.14f, 70.53f, 70.92f, 71.31f, 88.00f };
static const float s_lucideHourglassTopWedgeX[37] = { 28.00f, 28.00f, 28.01f, 28.04f, 28.09f, 28.15f, 28.24f, 28.34f, 28.47f, 28.61f, 28.77f, 28.95f, 29.14f, 29.35f, 29.58f, 29.82f, 30.07f, 30.34f, 48.00f, 65.66f, 65.93f, 66.18f, 66.42f, 66.65f, 66.86f, 67.05f, 67.23f, 67.39f, 67.53f, 67.66f, 67.76f, 67.85f, 67.91f, 67.96f, 67.99f, 68.00f, 68.00f };
static const float s_lucideHourglassTopWedgeY[37] = { 8.00f, 24.69f, 25.08f, 25.47f, 25.86f, 26.25f, 26.63f, 27.01f, 27.38f, 27.75f, 28.11f, 28.46f, 28.80f, 29.13f, 29.45f, 29.76f, 30.06f, 30.34f, 48.00f, 30.34f, 30.06f, 29.76f, 29.45f, 29.13f, 28.80f, 28.46f, 28.11f, 27.75f, 27.38f, 27.01f, 26.63f, 26.25f, 25.86f, 25.47f, 25.08f, 24.69f, 8.00f };

static void draw_icon_lucide_timer_hourglass(int ox, int oy, uint16_t color) {
    float dx = (float)ox, dy = (float)oy;
    float cx[2] = { dx + s_lucideHourglassCapTopX[0], dx + s_lucideHourglassCapTopX[1] };
    float cy[2] = { dy + s_lucideHourglassCapTopY[0], dy + s_lucideHourglassCapTopY[1] };
    shapes_stroke_polyline_aa_land(cx, cy, 2, LUCIDE_STROKE_HALF, color);
    cx[0] = dx + s_lucideHourglassCapBotX[0]; cx[1] = dx + s_lucideHourglassCapBotX[1];
    cy[0] = dy + s_lucideHourglassCapBotY[0]; cy[1] = dy + s_lucideHourglassCapBotY[1];
    shapes_stroke_polyline_aa_land(cx, cy, 2, LUCIDE_STROKE_HALF, color);
    float bx[37], by[37], tx[37], ty[37];
    for (int i = 0; i < 37; i++) {
        bx[i] = dx + s_lucideHourglassBottomWedgeX[i]; by[i] = dy + s_lucideHourglassBottomWedgeY[i];
        tx[i] = dx + s_lucideHourglassTopWedgeX[i];    ty[i] = dy + s_lucideHourglassTopWedgeY[i];
    }
    shapes_stroke_polyline_aa_land(bx, by, 37, LUCIDE_STROKE_HALF, color);
    shapes_stroke_polyline_aa_land(tx, ty, 37, LUCIDE_STROKE_HALF, color);
}

static const float s_lucideLoaderX[17] = { 84.00f, 82.24f, 77.12f, 69.16f, 59.12f, 48.00f, 36.87f, 26.84f, 18.88f, 13.76f, 12.00f, 13.76f, 18.88f, 26.84f, 36.88f, 48.00f, 59.12f };
static const float s_lucideLoaderY[17] = { 48.00f, 59.12f, 69.16f, 77.12f, 82.24f, 84.00f, 82.24f, 77.12f, 69.16f, 59.12f, 48.00f, 36.87f, 26.84f, 18.87f, 13.76f, 12.00f, 13.76f };

