s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
static void draw_icon_lucide_timer_loadercircle(int ox, int oy, uint16_t color) {
    float dx = (float)ox, dy = (float)oy;
    float xs[17], ys[17];
    for (int i = 0; i < 17; i++) { xs[i] = dx + s_lucideLoaderX[i]; ys[i] = dy + s_lucideLoaderY[i]; }
    shapes_stroke_polyline_aa_land(xs, ys, 17, LUCIDE_STROKE_HALF, color);
}

// 0 = keep painting the current shipped icon for that app; 1 (2 for
// sketch/timer's second candidate) previews the named Lucide candidate
// instead. All 0 until the owner has looked - see this pass's own report.
#define CHRONO_ICON_LUCIDE 1
#define SKETCH_ICON_LUCIDE 1 // 0=off, 1=pencil, 2=pencil-line
#define TIMER_ICON_LUCIDE  1 // 0=off, 1=hourglass, 2=loader-circle

/* ---------------------------------------------------------------------
 * The Connect Four icon (apps/four.c).
 *
 * NOT Lucide, and that is decision 0009's own instruction rather than an
 * inconsistency: its exception for this file covers "the case where a
 * matching Lucide source exists to convert", and Lucide has no Connect
 * Four glyph - grid-3x3 is a ruled grid of lines (which is exactly what
 * four.c's board deliberately is not), and grip/circle-dot are nine
 * identical dots that say nothing about the game. So this one goes back to
 * that document's original rule: the float brush, shapes.h's anti-aliased
 * disc and annulus, no ruler and no straight line anywhere in it.
 *
 * THIRD DESIGN, and the first two are recorded because each was rejected by
 * a MEASUREMENT rather than by taste - see tools/measure-menu-icons.ts,
 * which reports every icon's optical size and ink so that "does this one sit
 * with the others" has an answer instead of an opinion. The other three are
 * all exactly 90px tall and carry 2446-2884 ink px.
 *
 *   1. the app's board reduced to a 4x3 grid of holes, bottom row filled.
 *      68px tall and 25-45% MORE ink: small and heavy at once. Twelve shapes
 *      in a 96px box is a texture, and a texture has to be dark to be seen
 *      at all, so the fix for "it does not read" was making it heavier,
 *      which made it read even less like the three light open glyphs beside
 *      it.
 *   2. four rings tangent along a diagonal. Measured beautifully - 90x90,
 *      ink in range - and read as BEADS ON A STRING. Four circles spanning
 *      a 90px box are 22px each, and a 22px ring at any legible stroke has
 *      a 9-13px hole, which is a dot with a rim rather than a counter. The
 *      lesson worth keeping: the measurement is necessary and not
 *      sufficient, and only the render answers what a shape SAYS.
 *
 * What works is FEWER, BIGGER circles: four rings of 45px in a 2x2, tangent
 * to each other, filling the box. Big enough to read as counters - a 29px
 * hole inside each - which is the thing the first two versions could not buy
 * at any weight. It says four round pieces, which is this game's name and
 * its only component. It does not say "in a row", and that is the trade
 * taken for a glyph that is legible at 96px, on a panel held at arm's length
 * by someone who cannot read the word underneath. There is no word
 * underneath.
 *
 * NOT Lucide, and that is decision 0009's own instruction rather than an
 * inconsistency: its exception for this file covers "the case where a
 * matching Lucide source exists to convert", and Lucide has no Connect Four
 * glyph - grid-3x3 is a ruled grid of lines (exactly what four.c's board
 * deliberately is not) and grip/circle-dot are dots that say nothing about
 * the game. So this goes back to that document's original rule: the float
 * brush, shapes.h's anti-aliased annulus, no ruler and no straight line in
 * it anywhere.
 * ------------------------------------------------------------------- */
// Tangency solves the size, exactly as before, but at the OTHER THREE
// ICONS' OWN STROKE. That is the correction this pass exists for: the owner
// saw the four together and said "l'epaisseur du trait de l'icone du
// puissance 4 est pas la meme que les autres icones", and he was right -
// this one was drawn with the float brush at whatever weight the rings
// happened to land on (5px) while its three neighbours are Lucide
// conversions at LUCIDE_STROKE_HALF (10px). Same shape, wrong voice.
//
// With the stroke doubled, the ring's outer edge is what has to stay at
// 22.5 for the four to remain tangent inside a 90px optical box, so the
// CENTRELINE moves in instead: 22.5 - LUCIDE_STROKE_HALF = 17.5, leaving a
// 25px hole in each empty ring.
#define FOUR_ICON_R      17.5f    // centreline; outer edge is +LUCIDE_STROKE_HALF
#define FOUR_ICON_A      25.5f    // first centre, in icon-box coords
#define FOUR_ICON_B      70.5f    // second: 45 apart, so the rings are tangent

/* TWO OF THE FOUR ARE FILLED, ON THE DIAGONAL: bottom-left and top-right.
 * The owner's own instruction - "ce serait bien d'en colorier en noir plein
 * deux en diagonales (bas gauche et haut droit)" - and it is worth saying
 * what it buys, because it is more than decoration.
 *
 * Four empty rings say "counters". Two of them filled say A GAME IN
 * PROGRESS, which is what the app is, and the diagonal is the shape a
 * winning line takes. It also gives this icon the internal contrast the
 * other three have and it lacked: the pencil's solid tip, the stopwatch's
 * wedge, the hourglass's sand. Four identical outlines had no dark mass
 * anywhere and read as a pattern rather than a picture of something.
 */
static void draw_icon_four(int ox, int oy, uint16_t color) {
    // Row-major from the top-left. Filled on the anti-diagonal: index 1 is
    // top-right, index 2 is bottom-left.
    static const float CX[4] = { FOUR_ICON_A, FOUR_ICON_B, FOUR_ICON_A, FOUR_ICON_B };
    static const float CY[4] = { FOUR_ICON_A, FOUR_ICON_A, FOUR_ICON_B, FOUR_ICON_B };
    for (int i = 0; i < 4; i++) {
        float cx = (float)ox + CX[i], cy = (float)oy + CY[i];
        if (i == 1 || i == 2) {
            // A played counter fills the hole it sits in, so it is drawn at
            // the ring's OUTER radius: an empty cell and a full one are the
            // same size on a real board, and an icon where they were not
            // would read as two different objects.
            shapes_fill_disc_aa_land(cx, cy, FOUR_ICON_R + LUCIDE_STROKE_HALF, color);
        } else {
            shapes_fill_annulus_aa_land(cx, cy, FOUR_ICON_R + LUCIDE_STROKE_HALF,
                                         FOUR_ICON_R - LUCIDE_STROKE_HALF, color);
        }
    }
}

static void draw_icon_for(const app_t *app, int ox, int oy, uint16_t color) {
    if (app == &g_chronoApp) {
#if CHRONO_ICON_LUCIDE
        draw_icon_lucide_chrono(ox, oy, color);
#else
        draw_icon_chrono(ox, oy, color);
#endif
    } else if (app == &g_sketchApp) {
#if SKETCH_ICON_LUCIDE == 1
        draw_icon_lucide_sketch_pencil(ox, oy, color);
#elif SKETCH_ICON_LUCIDE == 2
        draw_icon_lucide_sketch_pencilline(ox, oy, color);
#else
        draw_icon_sketch(ox, oy, color);
#endif
    } else if (app == &g_timerApp) {
#if TIMER_ICON_LUCIDE == 1
        draw_icon_lucide_timer_hourglass(ox, oy, color);
#elif TIMER_ICON_LUCIDE == 2
        draw_icon_lucide_timer_loadercircle(ox, oy, color);
#elif TIMER_ICON_USE_COIL
        draw_icon_timer_coil(ox, oy, color);
#else
        draw_icon_timer(ox, oy, color);
#endif
    } else if (app == &g_fourApp) {
        draw_icon_four(ox, oy, color);
    }
    // g_levelApp (index 4, always in the table - see runtime_core.c) has no
    // case above and none is added here: it falls through to the "draws
    // nothing" comment below, same as any other app without a matching
    // icon. That is a real, silent gap in the menu today, not a fixture
    // artifact; recorded rather than papered over with a borrowed icon.
#if MENU_STUB_APPS
    // SCREENSHOT FIXTURE ONLY (apps/stubapps.c). Any app past the fifth in
    // a stub build borrows one of the four icon-bearing real apps, cycling,
    // so a capture at six or twelve apps shows the LAYOUT under real ink
    // rather than a grid of holes - a layout is judged against what will
    // actually sit in it. Starts at k=5, not 4: index 4 is the level, which
    // has no icon either and must fall through to the same silent gap a
    // real build gives it, not borrow one. Recursion is one level deep by
    // construction: g_apps[k & 3] is always one of chrono/sketch/timer/four,
    // which take the branches above.
    else {
        for (int k = 5; k < g_appCount; k++) {
            if (app == g_apps[k]) { draw_icon_for(g_apps[k & 3], ox, oy, color); return; }
        }
    }
#endif
    // An app added to g_apps[] without a matching icon here draws nothing -
    // a silent gap, not a fault. The menu is a navigation aid; it must
    // never be the thing that stops a build. There is no name to fall back
    // to any more either (see this file's header comment): an app with no
    // icon is simply an empty column, still fully touchable by position.
}

