s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
/* ---------------------------------------------------------------------
 * THE GESTURE: press, drag, release.
 *
 * It used to launch on the first tick a touch was seen. The owner wants the
 * same idiom the rest of the device uses instead - the sketchpad's palette
 * and Connect Four both work this way: put a thumb down, slide until the
 * thing you want is lit, let go. Three reasons it is worth the extra code,
 * in order of how much they matter:
 *
 *   - A TAP CANNOT BE TAKEN BACK. Launching on touch-down means a child who
 *     puts a thumb down to look is already inside an app, and the only way
 *     out is a two-button chord she has to be taught. Release-to-launch
 *     gives her the whole gesture to change her mind in.
 *   - ONE IDIOM, LEARNED ONCE. Press-slide-release now opens a colour, drops
 *     a piece, and picks an app. Nothing on this device asks for anything
 *     different.
 *   - IT MAKES THE TARGET VISIBLE. Under a tap there is no moment at which
 *     the device can say which app you are about to get: by the time it
 *     knows, it has already switched. Under a drag there is a whole
 *     gesture's worth of it, which is what the halo below is for.
 *
 * CANCELLING is the point of the change, so it gets a real region rather
 * than a corner: everything below the grid is dead space where nothing is
 * lit and a release does nothing - see menu_hit()'s own comment for how big
 * that region is at each app count and what it costs at twelve. Dragging
 * off the bottom edge of the glass passes through that zone on the way out,
 * so "leave the panel" cancels too without needing a rule of its own.
 *
 * DROPOUTS. The controller drops contact about 34 times a second while a
 * finger is down, so a gesture that ENDS on release cannot believe
 * f->touchDown going false - see apps/four.c's header section 2 for the
 * arithmetic behind the two numbers below, which are its numbers: a release
 * verdict needs MENU_RELEASE_GRACE_MS of continuous silence, and a gesture
 * arms only on contact sustained at a rate no stray burst can fake.
 *
 * JITTER, and this one is NEW here and is not in four.c. The same measured
 * profile that gives 34 dropouts a second also has the reported centroid
 * jumping 80-250px away from a finger that is not moving, and STAYING there
 * for one to three reports (TOUCHSIM_HARDWARE_MEASURED, calibrated against
 * a session where a deliberately still finger produced ten confirmed splits
 * in forty seconds). 80px is most of a cell. Under the old layout that
 * could move the halo a column sideways; under a grid it can move it a
 * column sideways OR a row down, and a lift during that window launches an
 * app the child never pointed at - which is this screen's most expensive
 * error, because the only way back out is a chord she has to be taught.
 *
 * So the lit cell is CONFIRMED before it moves: a new cell has to be the
 * reported one continuously for MENU_HOVER_CONFIRM_MS before the halo goes
 * there, and until then the cell the child is actually looking at stays
 * lit. Dropouts do NOT reset the count: a tick with no contact is not
 * evidence about position, so the window simply keeps running (the same
 * reasoning RELEASE_GRACE is built on).
 *
 * What this buys, stated as an invariant because it is the thing worth
 * testing: WHAT LAUNCHES IS ALWAYS WHAT WAS LIT. The launch verdict reads
 * hoverCell, hoverCell is what render_cell() drew a halo under, so the
 * device can never disagree with the child about which app she was pointing
 * at. Her instruction is "let go when the one you want is lit", and the
 * screen is the whole contract.
 *
 * NO WINDOW MAKES A WRONG HALO IMPOSSIBLE, and the reason is not the
 * obvious one. A jitter episode is at most three reports, so the first
 * guess is that any window past ~67ms is safe. It is not: the runtime holds
 * the LAST reported position while contact is bridged, and 34 dropouts a
 * second means more than half of all reports are lost, so a wrong position
 * survives long after the episode that produced it - until the next
 * truthful report arrives. The window therefore buys a RATE, not a
 * guarantee, which is why the number below came off a measurement rather
 * than off that arithmetic.
 *
 * MEASURED, and the counterfactual was run rather than argued.
 * emulator/wasm/tests/feature-menu-hover.ts samples the halo at every report
 * of twenty slide-and-lift gestures under the measured profile and counts
 * the times it MOVES to a cell the thumb never touched:
 *
 *     confirm window     excursions
 *          0ms           14 per 100 gestures
 *        100ms            4 per 100
 *        150ms            1 per 240      <- chosen
 *        200ms            0 per 240
 *
 * 150 rather than 200 because the cost is real and lands on the first light
 * too: the halo appears that long after the thumb does, and past about
 * 200ms a child gets no answer from the glass and presses again. The
 * remaining 0.4% is a halo that visibly sits on the wrong picture, which
 * she can see and slide off - not a silent wrong launch, which needs the
 * lift to land inside that same window.
 *
 * And worth knowing before trusting any of the above: the test's OTHER
 * counters (which app actually launched) read 20/20 at EVERY row of that
 * table, including 0ms. A gesture that settles before it lifts recovers on
 * its own, so an instrument reading only the launch cannot see this defect
 * at all, and the first version of this test did exactly that and was
 * green. Decision 0010's law arriving inside this file: the excursion
 * counter had to be built before anything could be measured.
 *
 * The state machine below is four.c's, second copy, plus the confirmation
 * above. Deliberate duplication, not an oversight: it is thirty lines, the
 * two apps do different things at the end of it (four.c drops a piece and
 * hands the puck over, this one switches app), and sharing it would mean a
 * new runtime-level header for two callers. If a third app needs it,
 * extract it then. The arithmetic that justifies the constants lives in
 * exactly one place either way, which is the part that would actually rot.
 * ------------------------------------------------------------------- */
#define MENU_RELEASE_GRACE_MS 300
#define MENU_ARM_SAMPLES        4
#define MENU_ARM_MS            40
#define MENU_ARM_RATE_HZ       15u
#define MENU_HOVER_CONFIRM_MS 150

// The halo: a soft grey disc behind the icon under the thumb. Round, so it
// needs no corner treatment at all (decision 0009), and one shapes.h call.
// Big enough to read as "this one" past a thumb, light enough that the black
// icon still sits clearly on top of it.
//
// CAPPED TO THE CELL IT LIVES IN, and that cap is load-bearing rather than
// tidy. Every push here is one cell, and shapes.h's primitives take no clip
// - so a halo wider or taller than its own cell paints into the neighbour,
// outside the rectangle that gets pushed, and stays there. That is decision
// 0001's second invariant broken and a grey crescent left stranded beside
// the icon you just left. It showed up as 250 outside-push violations the
// first time this ran, from 2px of overflow each side at four apps (112px
// columns, radius 58).
//
// The cap now takes the SMALLER of the cell's two dimensions, which it did
// not have to when a cell was the full 368px height and only width could
// bind. With MENU_CELL_H fixed at 112 the height is what binds at every app
// count, so the halo is a 106px disc with 3px of clearance on all four
// sides - and, usefully, it is the SAME SIZE at four apps as at twelve.
// Under the old columns it shrank as apps were added.
#define MENU_HALO_R_MAX 58.0f
#define MENU_HALO_GAP    3.0f

static uint16_t menu_halo_color(void) {
    return px_swap(0xDEFB); // #DEDEDE
}

