s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
/* ---------------------------------------------------------------------
 * Painting. One CELL at a time, and every push is one cell's landscape
 * rectangle - gfx maps a landscape rectangle to the panel with width and
 * height swapped, so the pushed row length is the landscape HEIGHT, which
 * is MENU_CELL_H = 112 and a multiple of 8 on every push, at rest and
 * mid-gesture alike (decision 0001). That is why MENU_CELL_H is 112 and not
 * 110: the cell size and the push rule are the same constant.
 *
 * This got CHEAPER rather than more complicated when the columns became
 * cells. The old code pushed a 368-tall strip to move a halo that only ever
 * occupied 96px of it; a cell push is 112 tall, so moving the halo one step
 * costs 30% of what it did, at any app count.
 *
 * A cell is redrawn from white every time rather than patched, so a halo
 * that has moved away cannot leave anything behind.
 *
 * NOTHING PAINTS THE CANCEL BAND, and nothing needs to: the runtime clears
 * the framebuffer to white and pushes the whole panel on the way in
 * (app.h's enter() contract), and no mark this file draws ever lands below
 * the grid.
 * ------------------------------------------------------------------- */
static void render_cell(int i, bool hovered) {
    int bx, by, bw, bh;
    cell_rect_land(i, &bx, &by, &bw, &bh);
    gfx_fill_rect_land(bx, by, bw, bh, PX_WHITE);
    int iconX = bx + (bw - ICON_W) / 2;
    int iconY = by + (bh - ICON_H) / 2;
    if (hovered) {
        // The SMALLER of the two half-extents, so the disc is contained in
        // both directions - see MENU_HALO_R_MAX's comment.
        float rw = (float)bw / 2.0f - MENU_HALO_GAP;
        float rh = (float)bh / 2.0f - MENU_HALO_GAP;
        float r = rw < rh ? rw : rh;
        if (r > MENU_HALO_R_MAX) r = MENU_HALO_R_MAX;
        shapes_fill_disc_aa_land((float)(bx + bw / 2), (float)(by + bh / 2),
                                  r, menu_halo_color());
    }
    draw_icon_for(g_apps[i], iconX, iconY, PX_BLACK);
}

static void push_cell(int i) {
    int bx, by, bw, bh;
    cell_rect_land(i, &bx, &by, &bw, &bh);
    gfx_push_land(bx, by, bw, bh);
}

static void menu_paint_all(void) {
    for (int i = 0; i < g_appCount; i++) render_cell(i, false);
}

/* ---------------------------------------------------------------------
 * State and the app_t callbacks.
 * ------------------------------------------------------------------- */
typedef struct {
    bool     contactSeen;      // a gesture is in progress (dropouts included)
    bool     armed;            // it has survived ARM_SAMPLES/ARM_MS at rate
    uint32_t gestureStartMs;
    uint32_t lastContactMs;    // last sample that actually reported contact
    int      contactCount;
    int      hoverCell;        // the lit cell, or -1 for none/cancel
    int      pendingCell;      // the cell being reported but not yet believed
    uint32_t pendingSinceMs;   // when it started being reported - see JITTER
} menu_state_t;

static menu_state_t *s_menu;

// Called by the runtime (see menu.h) before it switches into the menu, so it
// can tell menu_enter() which app to default a selection cursor to. That
// cursor is gone, so this file has nothing left to do with the value - but
// the function stays and keeps accepting it: runtime_core.c calls it
// unconditionally on every chord that opens the menu, and this file is not
// the one that gets to change that contract.
void menu_set_return_app(int index) {
    (void)index;
}

static void menu_enter(void) {
    s_menu = APP_STATE(menu_state_t);
    s_menu->hoverCell = -1;
    s_menu->pendingCell = -1;
    menu_paint_all();
}

static void menu_set_hover(int cell) {
    if (cell == s_menu->hoverCell) return;
    int old = s_menu->hoverCell;
    s_menu->hoverCell = cell;
    if (old >= 0)  { render_cell(old, false); push_cell(old); }
    if (cell >= 0) { render_cell(cell, true); push_cell(cell); }
}

static void menu_tick(const app_frame_t *f) {
    menu_state_t *s = s_menu;

    if (f->touchDown) {
        if (!s->contactSeen) {
            s->contactSeen = true;
            s->gestureStartMs = f->nowMs;
            s->contactCount = 0;
        }
        s->lastContactMs = f->nowMs;
        s->contactCount++;

        uint32_t elapsed = f->nowMs - s->gestureStartMs;
        if (!s->armed && s->contactCount >= MENU_ARM_SAMPLES && elapsed >= MENU_ARM_MS &&
            (uint32_t)s->contactCount * 1000u >= MENU_ARM_RATE_HZ * elapsed) {
            s->armed = true;
        }
        if (s->armed) {
            int lx, ly;
            panel_to_land(f->touchX, f->touchY, &lx, &ly);
            int cell = menu_hit(lx, ly);
            // THE CONFIRMATION. See JITTER in THE GESTURE's header comment:
            // a cell only becomes the lit one after being the reported one
            // for MENU_HOVER_CONFIRM_MS without interruption, so no burst
            // of 80-250px bad reports can move the halo, and what is lit is
            // always what a lift will launch. While a new cell is being
            // confirmed the previous one stays lit, which is the right
            // answer either way: it is the one the child is looking at.
            if (cell == s->pendingCell) {
                if (cell != s->hoverCell &&
                    (f->nowMs - s->pendingSinceMs) >= MENU_HOVER_CONFIRM_MS) {
                    menu_set_hover(cell);
                }
            } else {
                s->pendingCell = cell;
                s->pendingSinceMs = f->nowMs;
            }
        }
        return;
    }

    // No contact this tick. That is almost always a dropout, not a lift, so
    // nothing happens until the silence has lasted long enough to believe.
    if (!s->contactSeen) return;
    if ((f->nowMs - s->lastContactMs) < MENU_RELEASE_GRACE_MS) return;

    bool wasArmed = s->armed;
    int cell = s->hoverCell;
    s->contactSeen = false;
    s->armed = false;
    s->contactCount = 0;
    s->pendingCell = -1;
    menu_set_hover(-1);   // unlight first, so a cancel leaves the menu
                           // exactly as it was found

    if (!wasArmed || cell < 0) {
        // Cancelled: released in the dead band below the grid, dragged off
        // the glass, or never armed at all (a stray). The menu stays open,
        // which is the whole point of being able to change your mind.
        if (wasArmed) printf("menu: cancelled\r\n");
        return;
    }
    printf("menu: launch %d\r\n", cell);
    app_switch_to(cell);
}

const app_t g_menuApp = {
    .name       = "MENU",
    .enter      = menu_enter,
    .tick       = menu_tick,
    .leave      = NULL,
    .landscape  = true,
    .wantsShake = false,
};
